Layer (type)                 Output Shape              Param #   
=================================================================
depthwise_conv2d (DepthwiseC (None, 28, 28, 1)         25        
_________________________________________________________________
conv2d (Conv2D)              (None, 28, 28, 32)        64        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 7, 7, 32)          0         
_________________________________________________________________
depthwise_conv2d_1 (Depthwis (None, 7, 7, 32)          800       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 7, 7, 32)          1056      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 10)                330       
=================================================================
Total params: 2,275
Trainable params: 2,275
Non-trainable params: 0
_________________________________________________________________
10000/10000 [==============================] - 3s 330us/sample - loss: 0.1507 - acc: 0.9558