conv2d
max_pooling2d
conv2d_1
[0.90967534]
max_pooling2d_1
flatten
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 7, 7, 32)          0         
_________________________________________________________________
depthwise_conv2d_4 (Depthwis (None, 7, 7, 32)          800       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 32)          1056      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 1, 1, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 10)                330       
=================================================================
Total params: 3,018
Trainable params: 3,018
Non-trainable params: 0
_________________________________________________________________
10000/10000 [==============================] - 1s 125us/sample - loss: 13.2232 - acc: 0.0802